# ClassName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PushButtonData..::..ClassName Property
PushButtonData Class See Also
---
The name of the class containing the implementation for the command.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string ClassName { get; set; }
```

Visual Basic
---
```text
Public Property ClassName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ClassName {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The class name which implements the interface IExternalCommand.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when setting the value to nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting the value to an empty string. |

# See Also
PushButtonData Class
Autodesk.Revit.UI Namespace